# Лабораторная работа по основам программирования №2.
# Задача №1
import math

x = int(input("Введите значение х < - 1: "))
while x >= - 1:
    x = float(input("Введите правильное значение х-са: "))
n = int(input("Введите конечное значение n: "))
r = 0
k = 2*r + 1
f = -math.pi/2 + (-1)/(k*x**k)
r += 1
k2 = (2*r + 1) - k
f2 = x**k2
var = (x**k)*f2
while r <= n:
    if ((r + 1) % 2) == 0:
        f3 = 1 / ((2 * r + 1) * var)
        var *= f2
        f += f3
    else:
        f3 = 1 / ((2 * r + 1) * var)
        var *= f2
        f -= f3

    r += 1
print(f)


# Задача №2

w = input("Введите фразу содержащую более 10 (включиельно) символов: ")
w2 = int(len(w))

while w2 < 10:
    w = input("Недостаточное количество символов. Введите заново: ")

w3 = w2//2
print("а) ", w[:4:], "\nб)", w[-4::], "\nв)", w[w3], "\nг)", w[2:8])

# Задача №3

i = 0
while i < 1:
    ch = input("Введите 6 чисел: ")
    z = ch.split(',')
    a = len(z)
    if a != 6:
        continue
    i += 1

z1 = int(z[0])
z2 = int(z[1])
z3 = int(z[2])
z4 = int(z[3])
z5 = int(z[4])
z6 = int(z[5])
s = z1 + z2 + z3 + z4 + z5 + z6
sa = (z1 + z2 + z3 + z4 + z5 + z6) / 6
zz = [z1, z2, z3, z4, z5, z6]
print("а) ", z[3], "\nб) ", zz[::-1], "\nв) сумма чисел: ", s, "\nСреднее арифметическое: ", sa)
